{
  "backend/main.mo": "Defines raffle, entry, user profile types and manages raffles, entries, Stripe config, and access control with various query and update methods.",
  "feature_evidence.json": "Lists implemented features with related files, components, tests, and metadata for project evidence reporting.",
  "frontend-file-summaries.txt": "Provides short descriptions of all frontend components, pages, and hooks for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode colors, and base styling rules.",
  "frontend/index.html": "HTML entry point containing root mount element and script loading the React app.",
  "frontend/src/App.tsx": "Wraps the router with theme support and global toast notifications.",
  "frontend/src/components/admin/AdminGuard.tsx": "Checks admin status and blocks non-admin users with an access denied message.",
  "frontend/src/components/admin/RaffleForm.tsx": "Form for creating or editing raffles with fields for pricing, timing, and optional video URL.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin UI for configuring Stripe secret key and allowed countries with success and error handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling auth state and errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time users to submit their name and save their profile.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and shows a sign‑in prompt if the user is not authenticated.",
  "frontend/src/components/layout/AppLayout.tsx": "Top‑level layout with header, footer, and main content area.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing site credits and a link to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with navigation, login button, and responsive mobile menu; shows admin links if applicable.",
  "frontend/src/components/raffles/CountdownTimer.tsx": "Displays a live countdown to a target timestamp and shows 'Draw Time' when expired.",
  "frontend/src/components/raffles/PurchaseSpotsPanel.tsx": "Panel for authenticated users to select a quantity of raffle spots and start a checkout session.",
  "frontend/src/components/raffles/RaffleAuditPanel.tsx": "Shows completed‑raffle details including winner, metrics, draw date, and optional draw ID.",
  "frontend/src/components/raffles/RaffleCard.tsx": "Card view summarizing a raffle's price, prize, status, remaining spots, and draw time.",
  "frontend/src/hooks/admin/useAdminRaffles.ts": "Provides mutations for creating, updating, changing status, and triggering draws for raffles, with automatic cache invalidation.",
  "frontend/src/hooks/auth/useUserProfile.ts": "Contains queries and mutations for fetching, saving, and checking admin status of user profiles based on the caller’s identity.",
  "frontend/src/hooks/entries/useMyEntries.ts": "Fetches all raffles and filters entries belonging to the current user, returning enriched entry data sorted by purchase time.",
  "frontend/src/hooks/payments/useCreateCheckoutSession.ts": "Creates a Stripe checkout session and records entry purchases, then invalidates related queries and redirects to the session URL.",
  "frontend/src/hooks/payments/useStripeConfig.ts": "Provides hooks to check, set, and query Stripe configuration and session status using the backend actor.",
  "frontend/src/hooks/raffles/useCompletedRaffles.ts": "Fetches all completed raffles from the backend actor.",
  "frontend/src/hooks/raffles/useLiveRaffle.ts": "Retrieves live raffle data including countdown and entries with periodic refetching.",
  "frontend/src/hooks/raffles/useRaffles.ts": "Provides hooks to fetch all raffles, active raffles, and a specific raffle by ID.",
  "frontend/src/hooks/raffles/useRemainingSpots.ts": "Fetches and periodically refreshes remaining spot count for a raffle.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login, storage, and context handling for authentication state.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin landing page providing access to payment setup and raffle management tools.",
  "frontend/src/pages/admin/RaffleManagementPage.tsx": "Admin interface for creating, editing, updating status, and triggering draws for raffles, with dialogs and action handlers.",
  "frontend/src/pages/LiveDrawingPage.tsx": "Displays a live raffle drawing page with countdown, draw state, winner info, and optional video stream.",
  "frontend/src/pages/MyEntriesPage.tsx": "Displays the user's raffle entries, showing loading states, empty states, and entry details with status badges and winner highlighting.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancellation message with options to retry the purchase or browse raffles.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms a successful payment, checks Stripe session status, and provides navigation to raffle details or user entries.",
  "frontend/src/pages/RaffleDetailPage.tsx": "Loads and displays full raffle details, including status, pricing, dates, and purchase/audit panels, with fallbacks for loading and missing raffles.",
  "frontend/src/pages/RafflesPage.tsx": "Lists all raffles grouped by status with tabs, showing a hero section and prompting new users to set up their profile.",
  "frontend/src/router.tsx": "Defines the application's route structure using TanStack Router, connecting all major pages including admin and payment routes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s current state, features, requirements, and metadata for a raffle-style web application."
}